In [1]:
##Series

In [3]:
import pandas as pd

In [4]:
s = pd.Series([45, 67, 32, 14, 82])
s

0    45
1    67
2    32
3    14
4    82
dtype: int64

In [5]:
s = pd.Series([45, 67, 32, 14, 82, 32.12])
s

0    45.00
1    67.00
2    32.00
3    14.00
4    82.00
5    32.12
dtype: float64

In [6]:
s[3]

14.0

In [7]:
s[3] = 100
s

0     45.00
1     67.00
2     32.00
3    100.00
4     82.00
5     32.12
dtype: float64

In [8]:
s = pd.Series([45, 67, 32, 14, 82, 32.12], index = range(100, 106))

In [9]:
s

100    45.00
101    67.00
102    32.00
103    14.00
104    82.00
105    32.12
dtype: float64

In [10]:
##Dataframe

In [11]:
roll = pd.Series([1, 2, 3, 4, 5])
name = pd.Series(['Ajinkya', 'Amruta', 'Raj', 'Natasha', 'Neo'])
marks = pd.Series([76, 73, 81, 88, 85])

In [14]:
df = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks
})

In [15]:
df

   roll     name  marks
0     1  Ajinkya     76
1     2   Amruta     73
2     3      Raj     81
3     4  Natasha     88
4     5      Neo     85

In [16]:
import os
os.getcwd()

'C:\\Users\\saksh'

In [17]:
# location: https://mitu.co.in/dataset
# download all the files starting from student* and put them in same folder

In [18]:
##Import Data

In [24]:
df = pd.read_csv('student2.csv')

In [25]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [26]:
df1 = pd.read_csv('student1.csv')
df1

    1     anil  TE  56.77  22
0   2     amit  TE  59.77  21
1   3   aniket  BE  76.88  19
2   4  ajinkya  TE  69.66  20
3   5     asha  TE  63.28  20
4   6   ayesha  BE  49.55  20
5   7     amar  BE  65.34  19
6   8    amita  BE  68.33  23
7   9     amol  TE  56.75  20
8  10    anmol  BE  78.66  21

In [27]:
header = ['A', 'B', 'C', 'D', 'E']

In [28]:
df1 = pd.read_csv('student1.csv', names = header)
df1

    A        B   C      D   E
0   1     anil  TE  56.77  22
1   2     amit  TE  59.77  21
2   3   aniket  BE  76.88  19
3   4  ajinkya  TE  69.66  20
4   5     asha  TE  63.28  20
5   6   ayesha  BE  49.55  20
6   7     amar  BE  65.34  19
7   8    amita  BE  68.33  23
8   9     amol  TE  56.75  20
9  10    anmol  BE  78.66  21

In [31]:
df1 = pd.read_csv('student3.tsv', sep = '\t')
df1

   roll     name class  marks  age
0     1     anil    TE  56.77   22
1     2     amit    TE  59.77   21
2     3   aniket    BE  76.88   19
3     4  ajinkya    TE  69.66   20
4     5     asha    TE  63.28   20
5     6   ayesha    BE  49.55   20
6     7     amar    BE  65.34   19
7     8    amita    BE  68.33   23
8     9     amol    TE  56.75   20
9    10    anmol    BE  78.66   21

In [32]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [33]:
df.shape

(10, 5)

In [34]:
df.size

50

In [35]:
df.columns

Index(['roll', 'name', 'class', 'marks', 'age'], dtype='object')

In [36]:
list(df.columns)

['roll', 'name', 'class', 'marks', 'age']

In [37]:
df.T

           0      1       2        3      4       5     6      7      8      9
roll       1      2       3        4      5       6     7      8      9     10
name    anil   amit  aniket  ajinkya   asha  ayesha  amar  amita   amol  anmol
class     TE     TE      BE       TE    NaN      BE    BE     BE     TE     BE
marks  56.77  59.77   76.88    69.66  63.28   49.55   NaN    NaN  56.75  78.66
age     22.0   21.0    19.0      NaN   20.0    20.0  19.0   23.0   20.0   21.0

In [38]:
df.dtypes

roll       int64
name      object
class     object
marks    float64
age      float64
dtype: object

In [39]:
df.empty

False

In [40]:
df.values

array([[1, 'anil', 'TE', 56.77, 22.0],
       [2, 'amit', 'TE', 59.77, 21.0],
       [3, 'aniket', 'BE', 76.88, 19.0],
       [4, 'ajinkya', 'TE', 69.66, nan],
       [5, 'asha', nan, 63.28, 20.0],
       [6, 'ayesha', 'BE', 49.55, 20.0],
       [7, 'amar', 'BE', nan, 19.0],
       [8, 'amita', 'BE', nan, 23.0],
       [9, 'amol', 'TE', 56.75, 20.0],
       [10, 'anmol', 'BE', 78.66, 21.0]], dtype=object)

In [41]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [43]:
df.head()

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0

In [44]:
df.head(3)

   roll    name class  marks   age
0     1    anil    TE  56.77  22.0
1     2    amit    TE  59.77  21.0
2     3  aniket    BE  76.88  19.0

In [45]:
df.tail()

   roll    name class  marks   age
5     6  ayesha    BE  49.55  20.0
6     7    amar    BE    NaN  19.0
7     8   amita    BE    NaN  23.0
8     9    amol    TE  56.75  20.0
9    10   anmol    BE  78.66  21.0

In [46]:
df.tail(3)

   roll   name class  marks   age
7     8  amita    BE    NaN  23.0
8     9   amol    TE  56.75  20.0
9    10  anmol    BE  78.66  21.0

In [50]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   roll    10 non-null     int64
 1   name    10 non-null     object
 2   class   9 non-null      object
 3   marks   8 non-null      float64
 4   age     9 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 532.0+ bytes

In [53]:
df.count()

roll     10
name     10
class     9
marks     8
age       9
dtype: int64

In [58]:
df.max

<bound method DataFrame.max of    roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0>

In [56]:
df.sum

<bound method DataFrame.sum of    roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0>

In [59]:
df.describe()

           roll      marks        age
count  10.00000   8.000000   9.000000
mean    5.50000  63.915000  20.555556
std     3.02765  10.315294   1.333333
min     1.00000  49.550000  19.000000
25%     3.25000  56.765000  20.000000
50%     5.50000  61.525000  20.000000
75%     7.75000  71.465000  21.000000
max    10.00000  78.660000  23.000000

In [60]:
##Data Slicing

In [61]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [62]:
df.iloc[3:6, 0:3]

   roll     name class
3     4  ajinkya    TE
4     5     asha   NaN
5     6   ayesha    BE

In [63]:
df.iloc[6:,1:4]

    name class  marks
6   amar    BE    NaN
7  amita    BE    NaN
8   amol    TE  56.75
9  anmol    BE  78.66

In [64]:
df.iloc[[3,5,7,8],[0,2,3]]

   roll class  marks
3     4    TE  69.66
5     6    BE  49.55
7     8    BE    NaN
8     9    TE  56.75

In [65]:
df.iloc[:,1]

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [66]:
df.iloc[5,1]

'ayesha'

In [67]:
df

   roll     name class  marks   age
0     1     anil    TE  56.77  22.0
1     2     amit    TE  59.77  21.0
2     3   aniket    BE  76.88  19.0
3     4  ajinkya    TE  69.66   NaN
4     5     asha   NaN  63.28  20.0
5     6   ayesha    BE  49.55  20.0
6     7     amar    BE    NaN  19.0
7     8    amita    BE    NaN  23.0
8     9     amol    TE  56.75  20.0
9    10    anmol    BE  78.66  21.0

In [68]:
df.loc[3:7, 'name']

3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
Name: name, dtype: object

In [69]:
df.loc[:, 'name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [70]:
df.loc[:, ['name', 'marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar    NaN
7    amita    NaN
8     amol  56.75
9    anmol  78.66

In [71]:
df['name']

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object

In [72]:
df[['name', 'marks']]

      name  marks
0     anil  56.77
1     amit  59.77
2   aniket  76.88
3  ajinkya  69.66
4     asha  63.28
5   ayesha  49.55
6     amar    NaN
7    amita    NaN
8     amol  56.75
9    anmol  78.66

In [73]:
df.name

0       anil
1       amit
2     aniket
3    ajinkya
4       asha
5     ayesha
6       amar
7      amita
8       amol
9      anmol
Name: name, dtype: object